server/test/load/http-test.yml
config:
  target: 'http://localhost:3000'
  processor: './processor.js'
  phases:
    # 초기 유입
    - duration: 60
      arrivalRate: 5
      name: '일반 입장'

    # 급격한 유입
    - duration: 120
      arrivalRate: 20
      name: '피크 트래픽'

    # 안정화 구간
    - duration: 100
      arrivalRate: 10
      name: '안정화'

scenarios:
  - name: 'Stream Test'
    flow:
      - get:
          url: '/api/music/{{roomID}}/playlist.m3u8'
          afterResponse: 'processM3U8'