server/test/load/socket-test.yml
config:
  # 일단 로컬 환경 URL
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 2 # 초당 2명 = 분당 120명
      name: '일반 부하'

    # 피크 시간대 (전체 사용자의 약 70-80%)
    - duration: 120
      arrivalRate: 6 # 초당 6명 = 분당 360명
      name: '피크 부하'

    # 안정화 (전체 사용자의 약 50%)
    - duration: 100
      arrivalRate: 4 # 초당 4명 = 분당 240명

  engines:
    socketio-v3:
      transports: ['websocket']
      timeout: 10000
  variables:
    # 원하는 roomId 설정
    roomId: 'dec889e0-24a2-4d86-a36b-0c2fb9028e76'
scenarios:
  - name: 'Chat room flow'
    engine: socketio-v3
    flow:
      - think: 1

      - namespace: '/rooms'
        connect:
          query: 'roomId={{ roomId }}'
          headers:
            x-forwarded-for: '{{ $randomNumber(1000000, 9999999) }}'

      - think: 2

      - namespace: '/rooms'
        emit:
          channel: 'message'
          data:
            message: 'Test message'
            roomId: '{{ roomId }}'

      - think: 1

      - namespace: '/rooms'
        emit:
          channel: 'vote'
          data:
            # 일단 노래 두 개가 있다고 가정하고, 랜덤 값 지정
            trackNumber: '{{ $randomNumber(1,2) }}'

      - think: 30